// Ссылочные типы данных
/*
Наименование ссылочных типов данных начинается с большой буквы. В данном случае String является классом,
а согласно java конвенции имена классов пишутся с большой буквы.
Отличие примитивных типов данных от ссылочных заключается в том, что примитивный тип данных хранит в себе значение,
а ссылочный ссылается на объект класса
*/

public class Lesson3_Strings {
    public static void main(String[] args) {
        String hi = "Hello";
        String space = " ";
        String myName = "Adam";
        System.out.println(hi + space + myName);

    }
}
