// Примитивные типы данных
// Наименования примитивных типов данных начинаются с маленькой буквы

public class Variables {
    public static void main(String[] args) {
        byte myByte = 123;//от -128 до 128, 8 бит
        short myShort = 31876; //числа от -32000 до 32000, 16 бит
        char myChar = 'a'; //один символ/буква/цифра, 16 бит
        int myInteger = 1576; //целочисленные числа, 32 бита
        long myLong = 34254325; //большие числа, 64 бита

        float myFloat = 234.5f; //f ставится для плавающей точки, так как числа с плавающей точкой всегда по умолчанию double. 32 бита
        double myDouble = 243.56; //числа с плавающей точкой всегда по умолчанию double. 64 бита

        boolean myBoolean = true; // да или нет
    }
}
